lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
					</field>
				</fields>
			</register>
			<register>
				<name>SCR</name>
				<description>Scratch Pad Register. Eight-bit temporary storage for software.</description>
				<addressOffset>0x01C</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>Pad</name>
						<description>A readable, writable byte.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>ACR</name>
				<description>Auto-baud Control Register. Contains controls for the auto-baud feature.</description>
				<addressOffset>0x020</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>START</name>
						<description>This bit is automatically cleared after auto-baud completion.</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>AUTO_BAUD_STOP</name>
								<description>Auto-baud stop (auto-baud is not running).</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>AUTO_BAUD_START</name>
								<description>Auto-baud start (auto-baud is running). Auto-baud run bit. This bit is automatically cleared after auto-baud completion.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>MODE</name>
						<description>Auto-baud mode select bit.</description>
						<bitRange>[1:1]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>MODE_0_</name>
								<description>Mode 0.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>MODE_1_</name>
								<description>Mode 1.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>AUTORESTART</name>
						<description>Auto start mode</description>
						<bitRange>[2:2]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>NORESTART</name>
								<description>No restart</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RESTART_IN_CASE_OF_T</name>
								<description>Restart in case of time-out (counter restarts at next UART RX falling edge)</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[7:3]</bitRange>
						
					</field>
					<field>
						<name>ABEOINTCLR</name>
						<description>End of auto-baud interrupt clear bit (write only accessible).</description>
						<bitRange>[8:8]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>NOIMPACT</name>
								<description>Writing a 0 has no impact.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>CLEAR</name>
								<description>Writing a 1 will clear the corresponding interrupt in the IIR.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>ABTOINTCLR</name>
						<description>Auto-baud time-out interrupt clear bit (write only accessible).</description>
						<bitRange>[9:9]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>NOIMPACT</name>
								<description>Writing a 0 has no impact.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>CLEAR</name>
								<description>Writing a 1 will clear the corresponding interrupt in the IIR.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:10]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>ICR</name>
				<description>IrDA Control Register. Enables and configures the IrDA mode.</description>
				<addressOffset>0x024</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>IRDAEN</name>
						<description>IrDA mode enable.</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DISABLED</name>
								<description>IrDA mode on UARTn is disabled, UARTn acts as a standard UART.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ENABLED</name>
								<description>IrDA mode on UARTn is enabled.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>IRDAINV</name>
						<description>IrDA input polarity.</description>
						<bitRange>[1:1]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>NOTINVERTED</name>
								<description>The serial input is not inverted.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>INVERTED</name>
								<description>The serial input is inverted. This has no effect on the serial output.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>FIXPULSEEN</name>
						<description>IrDA fixed pulse width mode.</description>
						<bitRange>[2:2]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DISABLED</name>
								<description>IrDA fixed pulse width mode disabled.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ENABLED</name>
								<description>IrDA fixed pulse width mode enabled.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>PULSEDIV</name>
						<description>Configures the pulse when FixPulseEn = 1.</description>
						<bitRange>[5:3]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>2_TPCLK</name>
								<description>2 x TPCLK</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>4_TPCLK</name>
								<description>4 xTPCLK</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>8_TPCLK</name>
								<description>8 x TPCLK</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>16_TPCLK</name>
								<description>16 x TPCLK</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>32_TPCLK</name>
								<description>32 x TPCLK</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>64_TPCLK</name>
								<description>64 x TPCLK</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>128_TPCLK</name>
								<description>128x TPCLK</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>256_TPCLK</name>
								<description>256 x TPCLK</description>
								<value>0x7</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:6]</bitRange>
						
