lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
					</field>
				</fields>
			</register>
			<register>
				<name>CTCR</name>
				<description>Count Control Register. The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting.</description>
				<addressOffset>0x070</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CTM</name>
						<description>Counter/Timer Mode. This field selects which rising PCLK edges can increment Timer's Prescale Counter (PC), or clear PC and increment Timer Counter (TC). If Counter mode is selected in the TnCTCR, bits 2:0 in the Capture Control Register (TnCCR) must be programmed as 000.</description>
						<bitRange>[1:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>TIMER_MODE_EVERY_RI</name>
								<description>Timer Mode: every rising PCLK edge</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>COUNTER_MODE_TC_IS_</name>
								<description>Counter Mode: TC is incremented on rising edges on the CAP input selected by bits 3:2.</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>COUNTER_MODE_TC_IS_</name>
								<description>Counter Mode: TC is incremented on falling edges on the CAP input selected by bits 3:2.</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>COUNTER_MODE_TC_IS_</name>
								<description>Counter Mode: TC is incremented on both edges on the CAP input selected by bits 3:2.</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CIS</name>
						<description>Count Input Select. In counter mode (when bits 1:0 in this register are not 00), these bits select which CAP pin or comparator output is sampled for clocking:</description>
						<bitRange>[3:2]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>CT16BN_CAP0</name>
								<description>CT16Bn_CAP0</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>CT16BN_CAP1</name>
								<description>CT16Bn_CAP1</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>COMPARATOR_N,_LEVEL_</name>
								<description>Comparator n, level output</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>COMPARATOR_N,_EDGE_O</name>
								<description>Comparator n, edge output</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>ENCC</name>
						<description>Setting this bit to 1 enables clearing of the timer and the prescaler when the capture-edge event specified in bits 7:5 occurs.</description>
						<bitRange>[4:4]</bitRange>
						
					</field>
					<field>
						<name>SELCC</name>
						<description>When bit 4 is a 1, these bits select which capture input edge will cause the timer and prescaler to be cleared. These bits have no effect when bit 4 is low.</description>
						<bitRange>[7:5]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>RISING_EDGE_OF_CAP0_</name>
								<description>Rising Edge of CAP0 clears the timer (if bit 4 is set)</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>FALLING_EDGE_OF_CAP0</name>
								<description>Falling Edge of CAP0 clears the timer (if bit 4 is set)</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RISING_EDGE_OF_CAP1_</name>
								<description>Rising Edge of CAP1 clears the timer (if bit 4 is set)</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>FALLING_EDGE_OF_CAP1</name>
								<description>Falling Edge of CAP1 clears the timer (if bit 4 is set)</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RISING_EDGE_OF_CAP2_</name>
								<description>Rising Edge of CAP2 clears the timer (if bit 4 is set)</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>FALLING_EDGE_OF_CAP2</name>
								<description>Falling Edge of CAP2 clears the timer (if bit 4 is set)</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RISING_EDGE_OF_CAP3_</name>
								<description>Rising Edge of CAP3 clears the timer (if bit 4 is set)</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>FALLING_EDGE_OF_CAP3</name>
								<description>Falling Edge of CAP3 clears the timer (if bit 4 is set)</description>
								<value>0x7</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:8]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>PWMC</name>
				<description>PWM Control Register. The PWMCON enables PWM mode for the external match pins CT16B0_MAT[1:0] and CT16B1_MAT[1:0].</description>
				<addressOffset>0x074</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>PWMEN0</name>
						<description>PWM mode enable for channel0.</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>EM0</name>
								<description>CT16Bi_MAT0 is controlled by EM0.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>PWM_MODE_IS_ENABLED_</name>
								<description>PWM mode is enabled for CT16Bi_MAT0.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>PWMEN1</name>
						<description>PWM mode enable for channel1.</description>
						<bitRange>[1:1]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>EM1</name>
								<description>CT16Bi_MAT01 is controlled by EM1.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>PWM_MODE_IS_ENABLED_</name>
								<description>PWM mode is enabled for CT16Bi_MAT1.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>PWMEN2</name>
						<description>PWM mode enable for channel2.</description>
						<bitRange>[2:2]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>EM2</name>
								<description>CT16Bi_MAT2 is controlled by EM2.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>PWM_MODE_IS_ENABLED_</name>
								<description>PWM mode is enabled for CT16Bi_MAT2.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>PWMEN3</name>
						<description>PWM mode enable for channel3.</description>
						<bitRange>[3:3]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>EM3</name>
								<description>CT16Bi_MAT3 is controlled by EM3.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>PWM_MODE_IS_ENABLED_</name>
								<description>PWM mode is enabled for CT16Bi_MAT3.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
						<bitRange>[31:4]</bitRange>
						
