lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
					</field>
				</fields>
			</register>
		</registers>
    </peripheral>
	<peripheral derivedFrom="CT32B0">
		<name>CT32B1</name>
		<baseAddress>0x4001C000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFF</size> 
		<usage>registers</usage> 
		</addressBlock>	
		<interrupt>
			<name>CT32B1</name>
			<value>16</value>
		</interrupt>		
	</peripheral>
	<peripheral>
		<name>ADC</name>
		<description>Product name title=UM10441 Chapter title=LPC122x ADC Modification date=2/9/2011 Major revision=0 Minor revision=17 </description>
		<groupName>ADC</groupName>
		<baseAddress>0x40020000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFF</size> 
		<usage>registers</usage> 
		</addressBlock>	
		<interrupt>
			<name>ADC</name>
			<value>21</value>
		</interrupt>		
		<registers>
			<register>
				<name>CR</name>
				<description>A/D Control Register. The CR register must be written to select the operating mode before A/D conversion can occur.</description>
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>SEL</name>
						<description>Selects which of the AD7:0 pins is (are) to be sampled and converted. For ADC, bit 0 selects Pin AD0, and bit 7 selects pin AD7. In software-controlled mode, only one of these bits should be 1. In hardware scan mode, any value containing 1 to 8 ones. All zeroes is equivalent to 0x01.</description>
						<bitRange>[7:0]</bitRange>
						
					</field>
					<field>
						<name>CLKDIV</name>
						<description>The APB clock (PCLK) is divided by (this value plus one) to produce the clock for the A/D converter, which should be less than or equal to 9 MHz. Typically, software should program the smallest value in this field that yields a clock of 9 MHz or slightly less, but in certain cases (such as a high-impedance analog source) a slower clock may be desirable.</description>
						<bitRange>[15:8]</bitRange>
						
					</field>
					<field>
						<name>BURST</name>
						<description>Burst mode control.</description>
						<bitRange>[16:16]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>SOFTWARE</name>
								<description>Conversions are software controlled and require 36 clocks.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>BURST</name>
								<description>The AD converter does repeated conversions up to 250 kHz, scanning (if necessary) through the pins selected by 1s in the SEL field. The first conversion after the start corresponds to the least-significant 1 in the SEL field, then higher numbered 1 bits (pins) if applicable. Repeated conversions can be terminated by clearing this bit, but the conversion that is in progress when this bit is cleared will be completed. Important: START bits must be 000 when BURST = 1 or conversions will not start.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. These bits always read as zeros.</description>
						<bitRange>[23:17]</bitRange>
						
					</field>
					<field>
						<name>START</name>
						<description>Conversion start control. When the BURST bit is 0, these bits control whether and when an A/D conversion is started.</description>
						<bitRange>[26:24]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>NOSTART</name>
								<description>No start (this value should be used when clearing PDN to 0).</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>START</name>
								<description>Start conversion now.</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>STARTONPIO0_2</name>
								<description>Start conversion when the edge selected by bit 27 occurs on PIO0_2/SSEL/CT16B0_CAP0.</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>STARTONPIO1_5</name>
								<description>Start conversion when the edge selected by bit 27 occurs on PIO1_5/DIR/CT32B0_CAP0.</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>STARTONCT32B0_MAT0</name>
								<description>Start conversion when the edge selected by bit 27 occurs on CT32B0_MAT0.</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>STARTONCT32B0_MAT1</name>
								<description>Start conversion when the edge selected by bit 27 occurs on CT32B0_MAT1.</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>STARTONCT16B0_MAT0</name>
								<description>Start conversion when the edge selected by bit 27 occurs on CT16B0_MAT0.</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>STARTONCT16B0_MAT1</name>
								<description>Start conversion when the edge selected by bit 27 occurs on CT16B0_MAT1.</description>
								<value>0x7</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>EDGE</name>
						<description>Edge control. This bit is significant only when the START field contains 010-111.</description>
						<bitRange>[27:27]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>FALLING</name>
								<description>Start conversion on a falling edge on the selected CAP/MAT signal.</description>
								<value>1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RISING</name>
								<description>Start conversion on a rising edge on the selected CAP/MAT signal.</description>
								<value>0</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. These bits always read as zeros.</description>
						<bitRange>[31:28]</bitRange>
						
