lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
				</field>
				<field>
					<name>INV</name>
					<description>Invert input</description>
					<bitRange>[6:6]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>INPUT_NOT_INVERTED_</name>
							<description>Input not inverted.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_INVERTED_</name>
							<description>Input inverted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[7:7]</bitRange>
										
					
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[8:8]</bitRange>
										
					
				</field>
				<field>
					<name>DRV</name>
					<description>Drive current mode (Normal-drive pin).</description>
					<bitRange>[9:9]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>LOW_MODE_CURRENT_SEL</name>
							<description>Low mode current selected.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH_MODE_CURRENT_SE</name>
							<description>High mode current selected.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>OD</name>
					<description>Open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>OPEN_DRAIN_MODE_DISA</name>
							<description>Open-drain mode disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_MODE_ENAB</name>
							<description>Open-drain mode enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>S_MODE</name>
					<description>Sample mode</description>
					<bitRange>[12:11]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>BYPASS_INPUT_FILTER_</name>
							<description>Bypass input filter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ONEFILTERCLOCK</name>
							<description>Input pulses shorter than one filter clock are rejected.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TWOFILTERCLOCKS</name>
							<description>Input pulses shorter than two filter clocks are rejected.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THREEFILTERCLOCKS</name>
							<description>Input pulses shorter than three filter clocks are rejected.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLK_DIV</name>
					<description>Select peripheral clock divider for input filter sampling clock.</description>
					<bitRange>[15:13]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>IOCONFIGCLKDIV0_</name>
							<description>IOCONFIGCLKDIV0.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFIGCLKDIV1_</name>
							<description>IOCONFIGCLKDIV1.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFIGCLKDIV2_</name>
							<description>IOCONFIGCLKDIV2.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFIGCLKDIV3_</name>
							<description>IOCONFIGCLKDIV3.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFIGCLKDIV4_</name>
							<description>IOCONFIGCLKDIV4.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFIGCLKDIV5_</name>
							<description>IOCONFIGCLKDIV5.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFIGCLKDIV6_</name>
							<description>IOCONFIGCLKDIV6.</description>
							<value>0x6</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
										
					
				</field>
			</fields>
		</register>
		<register>
			<name>PIO0_16</name>
			<description>Configures pin PIO0_16/SSP_MISO/CT16B1_1.</description>
			<addressOffset>0x0A8</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000090</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FUNC</name>
					<description>Selects pin function.</description>
					<bitRange>[2:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>SELECTS_FUNCTION_PIO</name>
							<description>Selects function PIO0_16.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_DO_NOT_USE</name>
							<description>Reserved. Do not use.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MISO</name>
							<description>Select function MISO.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CT16</name>
							<description>Select function CT16B1_CAP1.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CT16</name>
							<description>Select function CT16B1_MAT1.</description>
							<value>0x4</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[3:3]</bitRange>
										
					
