lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
				</field>
				<field>
					<name>MODE</name>
					<description>Selects function mode (on-chip pull-up resistor control).</description>
					<bitRange>[4:4]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>INACTIVE_PULL_UP_RE</name>
							<description>Inactive (pull-up resistor not enabled).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_UP_RESISTOR_ENA</name>
							<description>Pull-up resistor enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[5:5]</bitRange>
										
					
				</field>
				<field>
					<name>INV</name>
					<description>Invert input</description>
					<bitRange>[6:6]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>INPUT_NOT_INVERTED_</name>
							<description>Input not inverted.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_INVERTED_</name>
							<description>Input inverted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[7:7]</bitRange>
										
					
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[8:8]</bitRange>
										
					
				</field>
				<field>
					<name>DRV</name>
					<description>Drive current mode (Normal-drive pin).</description>
					<bitRange>[9:9]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>LOW_MODE_CURRENT_SEL</name>
							<description>Low mode current selected.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH_MODE_CURRENT_SE</name>
							<description>High mode current selected.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>OD</name>
					<description>Open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>OPEN_DRAIN_MODE_DISA</name>
							<description>Open-drain mode disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_MODE_ENAB</name>
							<description>Open-drain mode enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>S_MODE</name>
					<description>Sample mode</description>
					<bitRange>[12:11]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>BYPASS_INPUT_FILTER_</name>
							<description>Bypass input filter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ONEFILTERCLOCK</name>
							<description>Input pulses shorter than one filter clock are rejected.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TWOFILTERCLOCKS</name>
							<description>Input pulses shorter than two filter clocks are rejected.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THREEFILTERCLOCKS</name>
							<description>Input pulses shorter than three filter clocks are rejected.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLK_DIV</name>
					<description>Select peripheral clock divider for input filter sampling clock.</description>
					<bitRange>[15:13]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>IOCONFIGCLKDIV0_</name>
							<description>IOCONFIGCLKDIV0.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFIGCLKDIV1_</name>
							<description>IOCONFIGCLKDIV1.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFIGCLKDIV2_</name>
							<description>IOCONFIGCLKDIV2.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFIGCLKDIV3_</name>
							<description>IOCONFIGCLKDIV3.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFIGCLKDIV4_</name>
							<description>IOCONFIGCLKDIV4.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFIGCLKDIV5_</name>
							<description>IOCONFIGCLKDIV5.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFIGCLKDIV6_</name>
							<description>IOCONFIGCLKDIV6.</description>
							<value>0x6</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
										
					
				</field>
			</fields>
		</register>
										
										
	</registers>
</peripheral>
	


<peripheral>
	<name>SYSCON</name>
	<description>Product name title=UM10441 Chapter title=LPC122x System
control (SYSCON) Modification date=8/18/2011 Major revision=2 Minor revision=0 </description>
	<groupName>SYSCON</groupName>
	<baseAddress>0x40048000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
		<name>START_PIO0_0</name>
		<value>0</value>
	</interrupt>
	<interrupt>
		<name>START_PIO0_1</name>
		<value>1</value>
	</interrupt>
	<interrupt>
		<name>START_PIO0_2</name>
		<value>2</value>
	</interrupt>
	<interrupt>
		<name>START_PIO0_3</name>
		<value>3</value>
	</interrupt>
	<interrupt>
		<name>START_PIO0_4</name>
		<value>4</value>
	</interrupt>
	<interrupt>
		<name>START_PIO0_5</name>
		<value>5</value>
	</interrupt>
	<interrupt>
		<name>START_PIO0_6</name>
		<value>6</value>
	</interrupt>
	<interrupt>
		<name>START_PIO0_7</name>
		<value>7</value>
	</interrupt>
	<interrupt>
		<name>START_PIO0_8</name>
		<value>8</value>
	</interrupt>
	<interrupt>
		<name>START_PIO0_9</name>
		<value>9</value>
	</interrupt>
	<interrupt>
		<name>START_PIO0_10</name>
		<value>10</value>
	</interrupt>
	<interrupt>
		<name>START_PIO0_11</name>
		<value>11</value>
	</interrupt>
	<interrupt>
		<name>BOD</name>
		<value>23</value>
	</interrupt>
	<registers>
		<register>
			<name>SYSMEMREMAP</name>
			<description>System memory remap</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MAP</name>
					<description>System memory remap. Value 0x3 is reserved.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>BOOT_LOADER_MODE_IN</name>
							<description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USER_RAM_MODE_INTER</name>
							<description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USER_FLASH_MODE_INT</name>
							<description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
					
