lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
				</field>
			</fields>
		</register>
		<register>
			<name>PRESETCTRL</name>
			<description>Peripheral reset control and flash timing overwrite</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000FFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SSP_RST_N</name>
					<description>SSP reset control</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SSP_RESET_ENABLED</name>
							<description>SSP reset enabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SSP_RESET_DE_ASSERTE</name>
							<description>SSP reset de-asserted</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>I2C_RST_N</name>
					<description>I2C reset control</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>I2C_RESET_ENABLED</name>
							<description>I2C reset enabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>I2C_RESET_DE_ASSERTE</name>
							<description>I2C reset de-asserted</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>UART0_RST_N</name>
					<description>UART0 reset control</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UART0_RESET_ENABLED</name>
							<description>UART0 reset enabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>UART0_RESET_DE_ASSER</name>
							<description>UART0 reset de-asserted</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>UART1_RST_N</name>
					<description>UART1 reset control</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UART1_RESET_ENABLED</name>
							<description>UART1 reset enabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>UART1_RESET_DE_ASSER</name>
							<description>UART1 reset de-asserted</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CT16B0_RST_N</name>
					<description>16-bit counter/timer 0 (CT16B0) reset control</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CT16B0_RESET_ENABLED</name>
							<description>CT16B0 reset enabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CT16B0_RESET_DE_ASSE</name>
							<description>CT16B0 reset de-asserted</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CT16B1_RST_N</name>
					<description>16-bit counter/timer 1 (CT16B1) reset control</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CT16B1_RESET_ENABLED</name>
							<description>CT16B1 reset enabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CT16B1_RESET_DE_ASSE</name>
							<description>CT16B1 reset de-asserted</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CT32B0_RST_N</name>
					<description>32-bit counter/timer 0 (CT32B0) reset control</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CT32B0_RESET_ENABLED</name>
							<description>CT32B0 reset enabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CT32B0_RESET_DE_ASSE</name>
							<description>CT32B0 reset de-asserted</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CT32B1_RST_N</name>
					<description>32-bit counter/timer 1 (CT32B1) reset control</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CT32B1_RESET_ENABLED</name>
							<description>CT32B1 reset enabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CT32B1_RESET_DE_ASSE</name>
							<description>CT32B1 reset de-asserted</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP_RST_N</name>
					<description>Comparator reset control</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>COMPARATOR_RESET_ENA</name>
							<description>Comparator reset enabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>COMPARATOR_RESET_DE_</name>
							<description>Comparator reset de-asserted</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CRC_RST_N</name>
					<description>CRC reset control</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CRC_RESET_ENABLED</name>
							<description>CRC reset enabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CRC_RESET_DE_ASSERTE</name>
							<description>CRC reset de-asserted</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMA_RST_N</name>
					<description>Micro DMA reset control</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DMA_RESET_ENABLED</name>
							<description>DMA reset enabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DMA_RESET_DE_ASSERTE</name>
							<description>DMA reset de-asserted</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[14:11]</bitRange>
					
