lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
				</field>
			</fields>
		</register>
		<register>
			<name>SYSTCKCAL</name>
			<description>System tick counter calibration</description>
			<addressOffset>0x154</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000001F</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CAL</name>
					<description>System tick timer calibration value</description>
					<bitRange>[25:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:26]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>AHBPRIO</name>
			<description>AHB priority setting</description>
			<addressOffset>0x158</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000004</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>M0PRIO</name>
					<description>Priority of the ARM Cortex-M0 core</description>
					<bitRange>[1:0]</bitRange>
				</field>
				<field>
					<name>DMAPRIO</name>
					<description>Priority of the micro DMA controller</description>
					<bitRange>[3:2]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[5:4]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:6]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>IRQLATENCY</name>
			<description>IQR delay. Allows trade-off between interrupt latency and determinism.</description>
			<addressOffset>0x170</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000010</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>LATENCY</name>
					<description>8-bit latency value</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTNMI</name>
			<description>NMI interrupt source configuration control</description>
			<addressOffset>0x174</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000003F</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>NMISRC</name>
					<description>NMI interrupt source select. Values 0x13 to 0x3E are reserved. 0x0 = I2C interrupt. 0x1 = CT16B0 interrupt. 0x2 = CT16B1 interrupt. 0x3 = CT32B0 interrupt. 0x4 = CT32B1 interrupt. 0x5 = SSP interrupt. 0x6 = UART0 interrupt. 0x7 = UART1 interrupt. 0x8 = Comparator interrupt. 0x9 = ADC interrupt. 0xA = Watchdog timer interrupt. 0xB = I2C interrupt. 0xC = Reserved. 0xD = PIO0 interrupt. 0xE = PIO1 interrupt. 0xF = PIO2 interrupt. 0x10 = PMU wake-up interrupt. 0x11 = DMA interrupt. 0x12 = RTC interrupt. 0x3F = NMI disabled.</description>
					<bitRange>[5:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:6]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STARTAPRP0</name>
			<description>Start logic edge control register 0</description>
			<addressOffset>0x200</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>APRPIO0_0</name>
					<description>Edge select for start logic input n for pin PIO0_0. 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>APRPIO0_1</name>
					<description>Edge select for start logic input n for pin PIO0_1. 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>APRPIO0_2</name>
					<description>Edge select for start logic input n for pin PIO0_2. 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>APRPIO0_3</name>
					<description>Edge select for start logic input n for pin PIO0_3. 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>APRPIO0_4</name>
					<description>Edge select for start logic input n for pin PIO0_4. 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>APRPIO0_5</name>
					<description>Edge select for start logic input n for pin PIO0_5. 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>APRPIO0_6</name>
					<description>Edge select for start logic input n for pin PIO0_6. 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>APRPIO0_7</name>
					<description>Edge select for start logic input n for pin PIO0_7. 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>APRPIO0_8</name>
					<description>Edge select for start logic input n for pin PIO0_8. 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>APRPIO0_9</name>
					<description>Edge select for start logic input n for pin PIO0_9. 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>APRPIO0_10</name>
					<description>Edge select for start logic input n for pin PIO0_10. 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>APRPIO0_11</name>
					<description>Edge select for start logic input n for pin PIO0_11. 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved register bits.</description>
					<bitRange>[31:12]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STARTERP0</name>
			<description>Start logic signal enable register 0</description>
			<addressOffset>0x204</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ERPIO0_0</name>
					<description>Enable start signal for start logic input n for pin PIO0_0. 0 = Disabled. 1 = Enabled.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>ERPIO0_1</name>
					<description>Enable start signal for start logic input n for pin PIO0_1. 0 = Disabled. 1 = Enabled.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>ERPIO0_2</name>
					<description>Enable start signal for start logic input n for pin PIO0_2. 0 = Disabled. 1 = Enabled.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>ERPIO0_3</name>
					<description>Enable start signal for start logic input n for pin PIO0_3. 0 = Disabled. 1 = Enabled.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>ERPIO0_4</name>
					<description>Enable start signal for start logic input n for pin PIO0_4. 0 = Disabled. 1 = Enabled.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>ERPIO0_5</name>
					<description>Enable start signal for start logic input n for pin PIO0_5. 0 = Disabled. 1 = Enabled.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>ERPIO0_6</name>
					<description>Enable start signal for start logic input n for pin PIO0_6. 0 = Disabled. 1 = Enabled.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>ERPIO0_7</name>
					<description>Enable start signal for start logic input n for pin PIO0_7. 0 = Disabled. 1 = Enabled.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>ERPIO0_8</name>
					<description>Enable start signal for start logic input n for pin PIO0_8. 0 = Disabled. 1 = Enabled.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>ERPIO0_9</name>
					<description>Enable start signal for start logic input n for pin PIO0_9. 0 = Disabled. 1 = Enabled.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>ERPIO0_10</name>
					<description>Enable start signal for start logic input n for pin PIO0_10. 0 = Disabled. 1 = Enabled.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>ERPIO0_11</name>
					<description>Enable start signal for start logic input n for pin PIO0_11. 0 = Disabled. 1 = Enabled.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved register bits.</description>
					<bitRange>[31:12]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STARTRSRP0CLR</name>
			<description>Start logic reset register 0</description>
			<addressOffset>0x208</addressOffset>
			<access>write-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RSRPIO0_0</name>
					<description>Start signal reset for start logic input n for pin PIO0_0. 0 = No effect. 1 = Write: reset start signal.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_1</name>
					<description>Start signal reset for start logic input n for pin PIO0_1. 0 = No effect. 1 = Write: reset start signal.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_2</name>
					<description>Start signal reset for start logic input n for pin PIO0_2. 0 = No effect. 1 = Write: reset start signal.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_3</name>
					<description>Start signal reset for start logic input n for pin PIO0_3. 0 = No effect. 1 = Write: reset start signal.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_4</name>
					<description>Start signal reset for start logic input n for pin PIO0_4. 0 = No effect. 1 = Write: reset start signal.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_5</name>
					<description>Start signal reset for start logic input n for pin PIO0_5. 0 = No effect. 1 = Write: reset start signal.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_6</name>
					<description>Start signal reset for start logic input n for pin PIO0_6. 0 = No effect. 1 = Write: reset start signal.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_7</name>
					<description>Start signal reset for start logic input n for pin PIO0_7. 0 = No effect. 1 = Write: reset start signal.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_8</name>
					<description>Start signal reset for start logic input n for pin PIO0_8. 0 = No effect. 1 = Write: reset start signal.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_9</name>
					<description>Start signal reset for start logic input n for pin PIO0_9. 0 = No effect. 1 = Write: reset start signal.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_10</name>
					<description>Start signal reset for start logic input n for pin PIO0_10. 0 = No effect. 1 = Write: reset start signal.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_11</name>
					<description>Start signal reset for start logic input n for pin PIO0_11. 0 = No effect. 1 = Write: reset start signal.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved register bits.</description>
					<bitRange>[31:12]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STARTSRP0</name>
			<description>Start logic status register 0</description>
			<addressOffset>0x20C</addressOffset>
			<access>read-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SRPIO0_0</name>
					<description>Start signal status for start logic input n for pin PIO0_0. 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>SRPIO0_1</name>
					<description>Start signal status for start logic input n for pin PIO0_1. 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>SRPIO0_2</name>
					<description>Start signal status for start logic input n for pin PIO0_2. 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>SRPIO0_3</name>
					<description>Start signal status for start logic input n for pin PIO0_3. 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>SRPIO0_4</name>
					<description>Start signal status for start logic input n for pin PIO0_4. 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>SRPIO0_5</name>
					<description>Start signal status for start logic input n for pin PIO0_5. 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>SRPIO0_6</name>
					<description>Start signal status for start logic input n for pin PIO0_6. 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>SRPIO0_7</name>
					<description>Start signal status for start logic input n for pin PIO0_7. 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>SRPIO0_8</name>
					<description>Start signal status for start logic input n for pin PIO0_8. 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>SRPIO0_9</name>
					<description>Start signal status for start logic input n for pin PIO0_9. 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>SRPIO0_10</name>
					<description>Start signal status for start logic input n for pin PIO0_10. 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>SRPIO0_11</name>
					<description>Start signal status for start logic input n for pin PIO0_11. 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved register bits.</description>
					<bitRange>[31:12]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STARTAPRP1</name>
			<description>Start logic edge control register 1; peripheral interrupts</description>
			<addressOffset>0x210</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved register bits.</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>APRWDT</name>
					<description>Edge select for start logic interrupt WDT. 0 = Falling edge. 1 = Rising edge.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>APRBOD</name>
					<description>Edge select for start logic interrupt BOD. 0 = Falling edge. 1 = Rising edge.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved register bits.</description>
					<bitRange>[17:12]</bitRange>
				</field>
				<field>
					<name>APRRTC</name>
					<description>Edge select for start logic interrupt RTC. 0 = Falling edge. 1 = Rising edge.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved register bits.</description>
					<bitRange>[31:19]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STARTERP1</name>
			<description>Start logic signal enable register 1; peripheral interrupts</description>
			<addressOffset>0x214</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved register bits.</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>ERWDT</name>
					<description>Enable start signal for start logic interrupt WDT. 0 = Disabled. 1 = Enabled.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>ERBOD</name>
					<description>Enable start signal for start logic interrupt BOD. 0 = Disabled. 1 = Enabled.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved register bits.</description>
					<bitRange>[17:12]</bitRange>
				</field>
				<field>
					<name>ERRTC</name>
					<description>Enable start signal for start logic interrupt RTC. 0 = Disabled. 1 = Enabled.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved register bits.</description>
					<bitRange>[31:19]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STARTRSRP1CLR</name>
			<description>Start logic reset register 1; peripheral interrupts</description>
			<addressOffset>0x218</addressOffset>
			<access>write-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved register bits.</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>RSRWDT</name>
					<description>Start signal reset for start logic interrupt WDT. 0 = No effect. 1 = Write: reset start signal.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>RSRBOD</name>
					<description>Start signal reset for start logic interrupt BOD. 0 = No effect. 1 = Write: reset start signal.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved register bits.</description>
					<bitRange>[17:12]</bitRange>
				</field>
				<field>
					<name>RSRRTC</name>
					<description>Start signal reset for start logic interrupt RTC. 0 = No effect. 1 = Write: reset start signal.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved register bits.</description>
					<bitRange>[31:19]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STARTSRP1</name>
			<description>Start logic status register 1; peripheral interrupts</description>
			<addressOffset>0x21C</addressOffset>
			<access>read-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved register bits.</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>SRWDT</name>
					<description>Start signal status for start logic interrupt WDT. 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>SRBOD</name>
					<description>Start signal status for start logic interrupt BOD. 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved register bits.</description>
					<bitRange>[17:12]</bitRange>
				</field>
				<field>
					<name>SRRTC</name>
					<description>Start signal status for start logic interrupt RTC. 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved register bits.</description>
					<bitRange>[31:19]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PDSLEEPCFG</name>
			<description>Power-down states in Deep-sleep mode</description>
			<addressOffset>0x230</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000FFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Always write these bits as ones.</description>
					<bitRange>[2:0]</bitRange>
					
