lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[14:12]</bitRange>
					
				</field>
				<field>
					<name>COMP_PD</name>
					<description>Comparator power-down</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
					
				</field>
			</fields>
		</register>
		<register>
			<name>DEVICE_ID</name>
			<description>Device ID</description>
			<addressOffset>0x3F4</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>DEVICEID</name>
					<description>Device ID for LPC122x parts: LPC12D27FBD100/301 = 0x3670 002B</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
	</registers>
</peripheral>

	
	<peripheral>
		<name>MICRO_DMA</name>
		<description>Product name title=UM10441 Chapter title=LPC122x General purpose micro DMA controller Modification date=2/10/2011 Major revision=0 Minor revision=17 </description>
		<groupName>MICRO_DMA</groupName>
		<baseAddress>0x4004C000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFF</size> 
		<usage>registers</usage> 
		</addressBlock>	
		<interrupt>
			<name>DMA</name>
			<value>29</value>
		</interrupt>		
		<registers>
			<register>
				<name>DMA_STATUS</name>
				<description>DMA status register</description>
				<addressOffset>0x000</addressOffset>
				<access>read-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASTER_EN</name>
						<description>Enable status of the controller: 0 = controller disabled. 1 = controller enabled.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[3:1]</bitRange>
					</field>
					<field>
						<name>STATE</name>
						<description>Current state of the control state machine. State can be one of the following: 0000 = idle 0001 = reading channel controller data 0010 = reading source data end pointer 0011 = reading destination data end pointer 0100 = reading source data 0101 = writing destination data 0110 = waiting for DMA request to clear 0111 = writing channel controller data 1000 = stalled 1001 = done 1010 = peripheral scatter-gather transition  1011-1111 = undefined</description>
						<bitRange>[7:4]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[15:8]</bitRange>
					</field>
					<field>
						<name>CHNLS</name>
						<description>The LPC122x micro DMA controller is configured for 21 channels. Reset value is number of channels - 1.</description>
						<bitRange>[20:16]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:21]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>DMA_CFG</name>
				<description>DMA configuration register</description>
				<addressOffset>0x004</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASTER_EN</name>
						<description>Enable for the controller:</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DISABLES_THE_CONTROL</name>
								<description>Disables the controller.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ENABLES_THE_CONTROLL</name>
								<description>Enables the controller.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Write as zero.</description>
						<bitRange>[4:1]</bitRange>
						
					</field>
					<field>
						<name>CHNL_PROT_CTRL1</name>
						<description>Channel protection access control:</description>
						<bitRange>[5:5]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>USER_ACCESS</name>
								<description>User access</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>PRIVILEGED_ACCESS</name>
								<description>Privileged access</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CHNL_PROT_CTRL2</name>
						<description>Channel protection buffer control:</description>
						<bitRange>[6:6]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>NON_BUFFERABLE</name>
								<description>Non-bufferable</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>BUFFERABLE</name>
								<description>Bufferable</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Write as zero.</description>
						<bitRange>[31:7]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>CTRL_BASE_PTR</name>
				<description>Channel control base pointer register</description>
				<addressOffset>0x008</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Write as zero.</description>
						<bitRange>[7:0]</bitRange>
					</field>
					<field>
						<name>CTRL_BASE_PTR</name>
						<description>Pointer to the base address of the primary data structure.</description>
						<bitRange>[31:8]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>ATL_CTRL_BASE_PTR</name>
				<description>Channel alternate control base pointer register</description>
				<addressOffset>0x00C</addressOffset>
				<access>read-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>ALT_CTRL_BASE_PTR</name>
						<description>Base address of the alternate data structure</description>
						<bitRange>[31:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>DMA_WAITONREQ_STATUS</name>
				<description>Channel wait on request status register</description>
				<addressOffset>0x010</addressOffset>
				<access>read-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DMA_WAITONREQ_STATUS0</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS1</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS2</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS3</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS4</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS5</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS6</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS7</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS8</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS9</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS10</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS11</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS12</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS13</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS14</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS15</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS16</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS17</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS18</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS19</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS20</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>DMA_WAITONREQ_STATUS21</name>
						<description>Channel c wait-on-request status (c = 0 to 20): Bit c = 0: dma_waitonreq[c] is LOW. Bit c = 1: dma_waitonreq[c] is HIGH.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:22]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>CHNL_SW_REQUEST</name>
				<description>Channel software request register</description>
				<addressOffset>0x014</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DMA_SW_REQUEST0</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST1</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST2</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST3</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST4</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST5</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST6</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST7</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST8</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST9</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST10</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST11</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST12</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST13</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST14</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST15</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST16</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST17</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST18</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST19</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST20</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>DMA_SW_REQUEST21</name>
						<description>Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Write as: Bit [c] = 0: Does not create a DMA request for channel c. Bit [c] = 1: Creates a DMA request for channel c.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:22]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>CHNL_USEBURST_SET</name>
				<description>Channel useburst set register</description>
				<addressOffset>0x018</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>DMA_USEBURST_SET4</name>
						<description>Returns the useburst status for channel c (c = 0 to 20) or disables dma_sreq[c] from generating DMA requests. (For channels 4 and 5 only.) Read as: Bit [c] = 0: DMA channel c responds to requests that it receives on dma_req[c] or dma_sreq[c]. The controller performs 2R, or single, bus transfers. Bit [c] = 1: DMA channel c does not respond to requests that it receives on dma_sreq[c]. The controller only responds to dma_req[c] requests and performs 2R transfers. Write as: Bit [c] = 0: No effect. Use the CHNL_USEBURST_CLR register to set bit [c] to 0. Bit [c] = 1: Disables dma_sreq[C] from generating DMA requests. The controller performs 2R transfers.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>DMA_USEBURST_SET5</name>
						<description>Returns the useburst status for channel c (c = 0 to 20) or disables dma_sreq[c] from generating DMA requests. (For channels 4 and 5 only.) Read as: Bit [c] = 0: DMA channel c responds to requests that it receives on dma_req[c] or dma_sreq[c]. The controller performs 2R, or single, bus transfers. Bit [c] = 1: DMA channel c does not respond to requests that it receives on dma_sreq[c]. The controller only responds to dma_req[c] requests and performs 2R transfers. Write as: Bit [c] = 0: No effect. Use the CHNL_USEBURST_CLR register to set bit [c] to 0. Bit [c] = 1: Disables dma_sreq[C] from generating DMA requests. The controller performs 2R transfers.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:6]</bitRange>
					</field>
				</fields>
			</register>
