lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
			<register>
				<name>CHNL_ENABLE_CLR</name>
				<description>Channel enable clear register</description>
				<addressOffset>0x02C</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CHNL_ENABLE_CLR0</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR1</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR2</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR3</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR4</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR5</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR6</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR7</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR8</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR9</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR10</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR11</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR12</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR13</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR14</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR15</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR16</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR17</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR18</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR19</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR20</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>CHNL_ENABLE_CLR21</name>
						<description>Set the appropriate bit to disable the corresponding DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_ENABLE_SET Register to enable DMA channels. Bit [c] = 1 Disables channel c.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:22]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>CHNL_PRI_ALT_SET</name>
				<description>Channel primary-alternate set register</description>
				<addressOffset>0x030</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CHNL_PRI_ALT_SET0</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET1</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET2</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET3</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET4</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET5</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET6</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET7</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET8</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET9</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET10</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET11</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET12</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET13</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET14</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET15</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET16</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET17</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET18</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET19</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET20</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>CHNL_PRI_ALT_SET21</name>
						<description>Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel c. Read as: Bit [c] = 0: DMA channel c is using the primary data structure. Bit [c] = 1: DMA channel c is using the alternate data structure. Write as: Bit [c] = 0: No effect. Use the CHNL_PRI_ALT_CLR Register to set bit [c] to 0. Bit [c] = 1: Selects the alternate data structure for channel c.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:22]</bitRange>
					</field>
				</fields>
			</register>
