lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
			<register>
				<name>CHNL_PRIORITY_CLR</name>
				<description>Channel priority clear register</description>
				<addressOffset>0x03C</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CHNL_PRIORITY_CLR0</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR1</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR2</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR3</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR4</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR5</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR6</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR7</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR8</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR9</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR10</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR11</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR12</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR13</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR14</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR15</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR16</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR17</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR18</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR19</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR20</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>CHNL_PRIORITY_CLR21</name>
						<description>Set the appropriate bit to select the default priority level for the specified DMA channel. Write as: Bit [c] = 0: No effect. Use the CHNL_PRIORITY_SET Register to set channel c to the high priority level. Bit [c] = 1: Channel c uses the default priority level.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:22]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>ERR_CLR</name>
				<description>Bus error clear register</description>
				<addressOffset>0x04C</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>ERR_CLR</name>
						<description>Returns the status of dma_error or sets the signal LOW. Read as: 0 = dma_err is LOW. 1 = dma_err is HIGH. Write as: 0 = No effect, status of dma_err is unchanged. 1 = Sets dma_err LOW.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Write as 0.</description>
						<bitRange>[31:1]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>CHNL_IRQ_STATUS</name>
				<description>Channel DMA interrupt status register</description>
				<addressOffset>0x080</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CHNL_IRQ_STAT0</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT1</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT2</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT3</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT4</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT5</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT6</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT7</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT8</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT9</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT10</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT11</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT12</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT13</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT14</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT15</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT16</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT17</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT18</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT19</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT20</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>CHNL_IRQ_STAT21</name>
						<description>Returns the status of the DMA done interrupt for each channel. Read as: Bit [c] = 0: DMA done interrupt not asserted. Bit [c] = 1: DMA transfer complete for Channel c. Write as: Bit [c] = 0: No effect.  Bit [c] = 1: Clears the DMA done status for Channel c.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:22]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IRQ_ERR_ENABLE</name>
				<description>DMA error interrupt enable register</description>
				<addressOffset>0x084</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>IRQ_ERR_ENABLE</name>
						<description>Enables the DMA error (dma_error) signal to create an interrupt. Write as: Bit 0 = 0: DMA error interrupt disabled. Bit 0 = 1: DMA error interrupt enabled.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:1]</bitRange>
					</field>
				</fields>
			</register>
