lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
		</registers>
    </peripheral>
	<peripheral>
		<name>RTC</name>
		<description>Product name title=UM10441 Chapter title=LPC122x Real-Time Clock (RTC) Modification date=2/11/2011 Major revision=1 Minor revision=0 </description>
		<groupName>RTC</groupName>
		<baseAddress>0x40050000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFF</size> 
		<usage>registers</usage> 
		</addressBlock>	
		<interrupt>
			<name>RTC</name>
			<value>30</value>
		</interrupt>		
		<registers>
			<register>
				<name>DR</name>
				<description>Data register</description>
				<addressOffset>0x000</addressOffset>
				<access>read-only</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DATA</name>
						<description>Returns the current RTC value.</description>
						<bitRange>[31:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>MR</name>
				<description>Match register</description>
				<addressOffset>0x004</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MATCH</name>
						<description>RTC match register value.</description>
						<bitRange>[31:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>LR</name>
				<description>Load register</description>
				<addressOffset>0x008</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>LOAD</name>
						<description>RTC load register value.</description>
						<bitRange>[31:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>CR</name>
				<description>Control register</description>
				<addressOffset>0x00C</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RTCSTART</name>
						<description>Enables the RTC. Once the RTC is enabled through this bit, any writes to this bit have no effect on the RTC until a system reset.</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>RTC_DISABLED_</name>
								<description>RTC disabled.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RTC_ENABLED_</name>
								<description>RTC enabled.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Read undefined. These bits should be written as zeros.</description>
						<bitRange>[31:1]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>ICSC</name>
				<description>Interrupt control set/clear register</description>
				<addressOffset>0x010</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RTCIC</name>
						<description>Interrupt control register. A read returns the current value of the RTC control register.</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>MASK</name>
								<description>Writing 0 masks the interrupt.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ENABLE</name>
								<description>Writing 1 enables the interrupt.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Read as zero. Do not modify these bits.</description>
						<bitRange>[31:1]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>RIS</name>
				<description>Raw interrupt status register</description>
				<addressOffset>0x014</addressOffset>
				<access>read-only</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RTCRIS</name>
						<description>Raw interrupt event flag register. A read returns the state of the raw interrupt event flag.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Read as zero.</description>
						<bitRange>[31:1]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>MIS</name>
				<description>Masked interrupt status register</description>
				<addressOffset>0x018</addressOffset>
				<access>read-only</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RTCMIS</name>
						<description>Masked interrupt register status. A read returns the masked interrupt status as controlled by the ICR register.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Read as zero.</description>
						<bitRange>[31:1]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>ICR</name>
				<description>Interrupt clear register</description>
				<addressOffset>0x01C</addressOffset>
				<access>write-only</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RTCICR</name>
						<description>Raw interrupt event flag clear register. Writing one clears the interrupt event flag. Writing 0 has no effect.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Write as zero.</description>
						<bitRange>[31:1]</bitRange>
					</field>
				</fields>
			</register>
		</registers>
	</peripheral>
	<peripheral>
		<name>ACOMP</name>
		<description>Product name title=UM10441 Chapter title=LPC122x Comparator Modification date=2/11/2011 Major revision=0 Minor revision=17 </description>
		<groupName>ACOMP</groupName>
		<baseAddress>0x40054000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFF</size> 
		<usage>registers</usage> 
		</addressBlock>	
		<interrupt>
			<name>ACOMP</name>
			<value>20</value>
		</interrupt>		
		<registers>
			<register>
				<name>CMP</name>
				<description>Comparator control register</description>
				<addressOffset>0x00</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CMP0_EN</name>
						<description>Comparator 0 enable.</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>COMPARATOR_0_DISABLE</name>
								<description>Comparator 0 disabled.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>COMPARATOR_0_ENABLED</name>
								<description>Comparator 0 enabled.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMP1_EN</name>
						<description>Comparator 1 enable.</description>
						<bitRange>[1:1]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>COMPARATOR_1_DISABLE</name>
								<description>Comparator 1 disabled.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>COMPARATOR_1_ENABLED</name>
								<description>Comparator 1 enabled.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMPIS</name>
						<description>Select interrupt source.</description>
						<bitRange>[2:2]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>EDGE_TRIGGERED_</name>
								<description>Edge triggered.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>LEVEL_TRIGGERED_</name>
								<description>Level triggered.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMPIEV</name>
						<description>Select edge triggered interrupt to be active on either high or low transitions.</description>
						<bitRange>[3:3]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>FALLING</name>
								<description>Interrupt active on falling edges.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RISING</name>
								<description>Interrupt active on rising edges.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMPBE</name>
						<description>Select edge triggered interrupt to be active on both edges.</description>
						<bitRange>[4:4]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>NOTBOTHEDGES</name>
								<description>Interrupt not active on both edges.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>BOTHEDGES</name>
								<description>Interrupt active on both edges.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMPSR</name>
						<description>Select orientation of the two comparators in the relaxation oscillator circuit.</description>
						<bitRange>[5:5]</bitRange>
						
