lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
					</field>
					<field>
						<name>CMPSA0</name>
						<description>Select async/sync output of the comparator 0.</description>
						<bitRange>[6:6]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DIRECT</name>
								<description>The comparator output is used directly.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SYNCH</name>
								<description>The comparator output is synchronized with the bus clock for output to other modules.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMPSA1</name>
						<description>Select async/sync output of the comparator 1.</description>
						<bitRange>[7:7]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>DIRECT</name>
								<description>The comparator output is used directly.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SYNCH</name>
								<description>The comparator output is synchronized with the bus clock for output to other modules.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMP0_VP_CTRL</name>
						<description>Selection of comparator 0, positive voltage (VP) input channel.</description>
						<bitRange>[10:8]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>VOLTAGE_LADDER_OUTPU</name>
								<description>Voltage ladder output</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I0</name>
								<description>ACMP0_I0</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I1</name>
								<description>ACMP0_I1</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I2</name>
								<description>ACMP0_I2</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I3</name>
								<description>ACMP0_I3</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I0</name>
								<description>ACMP1_I0</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I1</name>
								<description>ACMP1_I1</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>BOD_0_9_V_BAND_GAP</name>
								<description>BOD 0.9 V band gap</description>
								<value>0x7</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMP0_VM_CTRL</name>
						<description>Selection of comparator 0, negative voltage (VM) input channel.</description>
						<bitRange>[13:11]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>VOLTAGE_LADDER_OUTPU</name>
								<description>Voltage ladder output</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I0</name>
								<description>ACMP0_I0</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I1</name>
								<description>ACMP0_I1</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I2</name>
								<description>ACMP0_I2</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I3</name>
								<description>ACMP0_I3</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I0</name>
								<description>ACMP1_I0</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I1</name>
								<description>ACMP1_I1</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>BOD_0_9_V_BAND_GAP</name>
								<description>BOD 0.9 V band gap</description>
								<value>0x7</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMP1_VP_CTRL</name>
						<description>Selection of comparator 1, positive voltage (VP) input channel.</description>
						<bitRange>[16:14]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>VOLTAGE_LADDER_OUTPU</name>
								<description>Voltage ladder output</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I0</name>
								<description>ACMP1_I0</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I1</name>
								<description>ACMP1_I1</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I2</name>
								<description>ACMP1_I2</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I3</name>
								<description>ACMP1_I3</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I0</name>
								<description>ACMP0_I0</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I1</name>
								<description>ACMP0_I1</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>BOD_0_9_V_BAND_GAP</name>
								<description>BOD 0.9 V band gap</description>
								<value>0x7</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CMP1_VM_CTRL</name>
						<description>Selection of comparator 1, negative voltage (VM) input channel.</description>
						<bitRange>[19:17]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>VOLTAGE_LADDER_OUTPU</name>
								<description>Voltage ladder output</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I0</name>
								<description>ACMP1_I0</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I1</name>
								<description>ACMP1_I1</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I2</name>
								<description>ACMP1_I2</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP1_I3</name>
								<description>ACMP1_I3</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I0</name>
								<description>ACMP0_I0</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMP0_I1</name>
								<description>ACMP0_I1</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>BOD_0_9_V_BAND_GAP</name>
								<description>BOD 0.9 V band gap</description>
								<value>0x7</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>INTCLR</name>
						<description>Interrupt clear bit. Setting this bit to one clears the comparator interrupt.</description>
						<bitRange>[20:20]</bitRange>
						
