lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
					</field>
					<field>
						<name>CMP0STAT</name>
						<description>Comparator 0 status. This bit reflects the state of the comparator 0 output.</description>
						<bitRange>[21:21]</bitRange>
						
					</field>
					<field>
						<name>CMP1STAT</name>
						<description>Comparator 1 status. This bit reflects the state of the comparator 1 output.</description>
						<bitRange>[22:22]</bitRange>
						
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved.</description>
						<bitRange>[31:23]</bitRange>
						
					</field>
				</fields>
			</register>
			<register>
				<name>VLAD</name>
				<description>Voltage ladder register</description>
				<addressOffset>0x04</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>VLADEN</name>
						<description>Voltage ladder enable</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>VOLTAGE_LADDER_DISAB</name>
								<description>Voltage ladder disabled.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>VOLTAGE_LADDER_ENABL</name>
								<description>Voltage ladder enabled.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>VSEL</name>
						<description>Voltage ladder value. The reference voltage Vref depends on the setting of bit 6 in this register (either V DD(3V3) or voltage on pin VREF_CMP): 0000 = VSS 0001 = 1 x Vref/31 0010 = 2 x Vref/31 ... 11111 = Vref</description>
						<bitRange>[5:1]</bitRange>
						
					</field>
					<field>
						<name>VLADREF</name>
						<description>Voltage reference select</description>
						<bitRange>[6:6]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>VREF_CMP_PIN</name>
								<description>VREF_CMP pin</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>VDD3V3_PIN</name>
								<description>VDD(3V3) pin</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Unused</description>
						<bitRange>[31:7]</bitRange>
						
					</field>
				</fields>
			</register>
		</registers>
    </peripheral>
	<peripheral>
		<name>GPIO0</name>
		<description>Product name title=UM10441 Chapter title=LPC122x General Purpose I/O (GPIO) Modification date=2/11/2011 Major revision=0 Minor revision=17 </description>
		<groupName>GPIO</groupName>
		<baseAddress>0x50000000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFFF</size> 
		<usage>registers</usage> 
		</addressBlock>	
		<interrupt>
			<name>PIO0</name>
			<value>25</value>
		</interrupt>
		<registers>
			<register>
				<name>MASK</name>
				<description>Pin value mask register. Affects operations on PIN, OUT, SET, CLR, and NOT registers.</description>
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASK0</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>MASK1</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>MASK2</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>MASK3</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>MASK4</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>MASK5</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>MASK6</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>MASK7</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>MASK8</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>MASK9</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>MASK10</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK11</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>MASK12</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>MASK13</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>MASK14</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>MASK15</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>MASK16</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>MASK17</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>MASK18</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>MASK19</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>MASK20</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>MASK21</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>MASK22</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[22:22]</bitRange>
					</field>
					<field>
						<name>MASK23</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[23:23]</bitRange>
					</field>
					<field>
						<name>MASK24</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[24:24]</bitRange>
					</field>
					<field>
						<name>MASK25</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[25:25]</bitRange>
					</field>
					<field>
						<name>MASK26</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[26:26]</bitRange>
					</field>
					<field>
						<name>MASK27</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[27:27]</bitRange>
					</field>
					<field>
						<name>MASK28</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[28:28]</bitRange>
					</field>
					<field>
						<name>MASK29</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[29:29]</bitRange>
					</field>
					<field>
						<name>MASK30</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>MASK31</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>PIN</name>
				<description>Pin value register.</description>
				<addressOffset>0x004</addressOffset>
				<access>read-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>PIN0</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>PIN1</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>PIN2</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>PIN3</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>PIN4</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>PIN5</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>PIN6</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>PIN7</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>PIN8</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>PIN9</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>PIN10</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>PIN11</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>PIN12</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>PIN13</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>PIN14</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>PIN15</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>PIN16</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>PIN17</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>PIN18</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>PIN19</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>PIN20</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>PIN21</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>PIN22</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[22:22]</bitRange>
					</field>
					<field>
						<name>PIN23</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[23:23]</bitRange>
					</field>
					<field>
						<name>PIN24</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[24:24]</bitRange>
					</field>
					<field>
						<name>PIN25</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[25:25]</bitRange>
					</field>
					<field>
						<name>PIN26</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[26:26]</bitRange>
					</field>
					<field>
						<name>PIN27</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[27:27]</bitRange>
					</field>
					<field>
						<name>PIN28</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[28:28]</bitRange>
					</field>
					<field>
						<name>PIN29</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[29:29]</bitRange>
					</field>
					<field>
						<name>PIN30</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>PIN31</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
