lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
			<register>
				<name>IS</name>
				<description>Interrupt sense register.</description>
				<addressOffset>0x024</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>ISENSE0</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>ISENSE1</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>ISENSE2</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>ISENSE3</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>ISENSE4</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>ISENSE5</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>ISENSE6</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>ISENSE7</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>ISENSE8</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>ISENSE9</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>ISENSE10</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>ISENSE11</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>ISENSE12</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>ISENSE13</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>ISENSE14</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>ISENSE15</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>ISENSE16</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>ISENSE17</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>ISENSE18</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>ISENSE19</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>ISENSE20</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>ISENSE21</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>ISENSE22</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[22:22]</bitRange>
					</field>
					<field>
						<name>ISENSE23</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[23:23]</bitRange>
					</field>
					<field>
						<name>ISENSE24</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[24:24]</bitRange>
					</field>
					<field>
						<name>ISENSE25</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[25:25]</bitRange>
					</field>
					<field>
						<name>ISENSE26</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[26:26]</bitRange>
					</field>
					<field>
						<name>ISENSE27</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[27:27]</bitRange>
					</field>
					<field>
						<name>ISENSE28</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[28:28]</bitRange>
					</field>
					<field>
						<name>ISENSE29</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[29:29]</bitRange>
					</field>
					<field>
						<name>ISENSE30</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>ISENSE31</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IBE</name>
				<description>Interrupt both edges register.</description>
				<addressOffset>0x028</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>IBE0</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>IBE1</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>IBE2</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>IBE3</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>IBE4</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>IBE5</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>IBE6</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>IBE7</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>IBE8</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>IBE9</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>IBE10</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>IBE11</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>IBE12</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>IBE13</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>IBE14</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>IBE15</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>IBE16</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>IBE17</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>IBE18</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>IBE19</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>IBE20</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>IBE21</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>IBE22</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[22:22]</bitRange>
					</field>
					<field>
						<name>IBE23</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[23:23]</bitRange>
					</field>
					<field>
						<name>IBE24</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[24:24]</bitRange>
					</field>
					<field>
						<name>IBE25</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[25:25]</bitRange>
					</field>
					<field>
						<name>IBE26</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[26:26]</bitRange>
					</field>
					<field>
						<name>IBE27</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[27:27]</bitRange>
					</field>
					<field>
						<name>IBE28</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[28:28]</bitRange>
					</field>
					<field>
						<name>IBE29</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[29:29]</bitRange>
					</field>
					<field>
						<name>IBE30</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>IBE31</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
