lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
			<register>
				<name>IEV</name>
				<description>Interrupt event register.</description>
				<addressOffset>0x02C</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>IEV0</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>IEV1</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>IEV2</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>IEV3</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>IEV4</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>IEV5</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>IEV6</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>IEV7</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>IEV8</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>IEV9</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>IEV10</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>IEV11</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>IEV12</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>IEV13</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>IEV14</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>IEV15</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>IEV16</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>IEV17</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>IEV18</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>IEV19</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>IEV20</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>IEV21</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>IEV22</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[22:22]</bitRange>
					</field>
					<field>
						<name>IEV23</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[23:23]</bitRange>
					</field>
					<field>
						<name>IEV24</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[24:24]</bitRange>
					</field>
					<field>
						<name>IEV25</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[25:25]</bitRange>
					</field>
					<field>
						<name>IEV26</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[26:26]</bitRange>
					</field>
					<field>
						<name>IEV27</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[27:27]</bitRange>
					</field>
					<field>
						<name>IEV28</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[28:28]</bitRange>
					</field>
					<field>
						<name>IEV29</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[29:29]</bitRange>
					</field>
					<field>
						<name>IEV30</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>IEV31</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IE</name>
				<description>Interrupt mask register.</description>
				<addressOffset>0x030</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASK0</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>MASK1</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>MASK2</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>MASK3</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>MASK4</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>MASK5</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>MASK6</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>MASK7</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>MASK8</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>MASK9</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>MASK10</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK11</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>MASK12</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>MASK13</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>MASK14</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>MASK15</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>MASK16</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>MASK17</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>MASK18</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>MASK19</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>MASK20</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>MASK21</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>MASK22</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[22:22]</bitRange>
					</field>
					<field>
						<name>MASK23</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[23:23]</bitRange>
					</field>
					<field>
						<name>MASK24</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[24:24]</bitRange>
					</field>
					<field>
						<name>MASK25</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[25:25]</bitRange>
					</field>
					<field>
						<name>MASK26</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[26:26]</bitRange>
					</field>
					<field>
						<name>MASK27</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[27:27]</bitRange>
					</field>
					<field>
						<name>MASK28</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[28:28]</bitRange>
					</field>
					<field>
						<name>MASK29</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[29:29]</bitRange>
					</field>
					<field>
						<name>MASK30</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>MASK31</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
