lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
			<register>
				<name>RIS</name>
				<description>Raw interrupt status register.</description>
				<addressOffset>0x034</addressOffset>
				<access>read-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RAWST0</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RAWST1</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RAWST2</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RAWST3</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RAWST4</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RAWST5</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RAWST6</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RAWST7</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>RAWST8</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>RAWST9</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>RAWST10</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>RAWST11</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>RAWST12</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>RAWST13</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>RAWST14</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>RAWST15</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>RAWST16</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>RAWST17</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>RAWST18</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>RAWST19</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>RAWST20</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>RAWST21</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>RAWST22</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[22:22]</bitRange>
					</field>
					<field>
						<name>RAWST23</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[23:23]</bitRange>
					</field>
					<field>
						<name>RAWST24</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[24:24]</bitRange>
					</field>
					<field>
						<name>RAWST25</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[25:25]</bitRange>
					</field>
					<field>
						<name>RAWST26</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[26:26]</bitRange>
					</field>
					<field>
						<name>RAWST27</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[27:27]</bitRange>
					</field>
					<field>
						<name>RAWST28</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[28:28]</bitRange>
					</field>
					<field>
						<name>RAWST29</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[29:29]</bitRange>
					</field>
					<field>
						<name>RAWST30</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>RAWST31</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>MIS</name>
				<description>Masked interrupt status register.</description>
				<addressOffset>0x038</addressOffset>
				<access>read-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASK0</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>MASK1</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>MASK2</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>MASK3</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>MASK4</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>MASK5</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>MASK6</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>MASK7</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>MASK8</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>MASK9</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>MASK10</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK11</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>MASK12</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>MASK13</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>MASK14</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>MASK15</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>MASK16</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>MASK17</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>MASK18</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>MASK19</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>MASK20</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>MASK21</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>MASK22</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[22:22]</bitRange>
					</field>
					<field>
						<name>MASK23</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[23:23]</bitRange>
					</field>
					<field>
						<name>MASK24</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[24:24]</bitRange>
					</field>
					<field>
						<name>MASK25</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[25:25]</bitRange>
					</field>
					<field>
						<name>MASK26</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[26:26]</bitRange>
					</field>
					<field>
						<name>MASK27</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[27:27]</bitRange>
					</field>
					<field>
						<name>MASK28</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[28:28]</bitRange>
					</field>
					<field>
						<name>MASK29</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[29:29]</bitRange>
					</field>
					<field>
						<name>MASK30</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>MASK31</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
