lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
			<register>
				<name>IC</name>
				<description>Interrupt clear register.</description>
				<addressOffset>0x03C</addressOffset>
				<access>write-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CLR0</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CLR1</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CLR2</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CLR3</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CLR4</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CLR5</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CLR6</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>CLR7</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>CLR8</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>CLR9</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>CLR10</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>CLR11</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>CLR12</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>CLR13</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>CLR14</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>CLR15</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[15:15]</bitRange>
					</field>
					<field>
						<name>CLR16</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>CLR17</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[17:17]</bitRange>
					</field>
					<field>
						<name>CLR18</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[18:18]</bitRange>
					</field>
					<field>
						<name>CLR19</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[19:19]</bitRange>
					</field>
					<field>
						<name>CLR20</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>CLR21</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>CLR22</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[22:22]</bitRange>
					</field>
					<field>
						<name>CLR23</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[23:23]</bitRange>
					</field>
					<field>
						<name>CLR24</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[24:24]</bitRange>
					</field>
					<field>
						<name>CLR25</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[25:25]</bitRange>
					</field>
					<field>
						<name>CLR26</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[26:26]</bitRange>
					</field>
					<field>
						<name>CLR27</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[27:27]</bitRange>
					</field>
					<field>
						<name>CLR28</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[28:28]</bitRange>
					</field>
					<field>
						<name>CLR29</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[29:29]</bitRange>
					</field>
					<field>
						<name>CLR30</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[30:30]</bitRange>
					</field>
					<field>
						<name>CLR31</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
