lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
		</registers>
	</peripheral>
	<peripheral>
		<name>GPIO1</name>
		<description>Product name title=UM10441 Chapter title=LPC122x General Purpose I/O (GPIO) Modification date=2/11/2011 Major revision=0 Minor revision=17 </description>
		<groupName>GPIO</groupName>
		<baseAddress>0x50010000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFFF</size> 
		<usage>registers</usage> 
		</addressBlock>	
		<interrupt>
			<name>PIO1</name>
			<value>26</value>
		</interrupt>		
		<registers>
			<register>
				<name>MASK</name>
				<description>Pin value mask register. Affects operations on PIN, OUT, SET, CLR, and NOT registers.</description>
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASK0</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>MASK1</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>MASK2</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>MASK3</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>MASK4</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>MASK5</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>MASK6</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>PIN</name>
				<description>Pin value register.</description>
				<addressOffset>0x004</addressOffset>
				<access>read-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>PIN0</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>PIN1</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>PIN2</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>PIN3</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>PIN4</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>PIN5</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>PIN6</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>OUT</name>
				<description>Pin output value register.</description>
				<addressOffset>0x008</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>OUT0</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>OUT1</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>OUT2</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>OUT3</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>OUT4</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>OUT5</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>OUT6</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>SET</name>
				<description>Pin output value set register.</description>
				<addressOffset>0x00C</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>SET0</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>SET1</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>SET2</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>SET3</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>SET4</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>SET5</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>SET6</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>CLR</name>
				<description>Pin output value clear register.</description>
				<addressOffset>0x010</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CLEAR0</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CLEAR1</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CLEAR2</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CLEAR3</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CLEAR4</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CLEAR5</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CLEAR6</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>NOT</name>
				<description>Pin output value invert register.</description>
				<addressOffset>0x014</addressOffset>
				<access>write-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>NOT0</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>NOT1</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>NOT2</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>NOT3</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>NOT4</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>NOT5</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>NOT6</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>DIR</name>
				<description>Data direction register.</description>
				<addressOffset>0x020</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>IO0</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>IO1</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>IO2</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>IO3</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>IO4</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>IO5</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>IO6</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IS</name>
				<description>Interrupt sense register.</description>
				<addressOffset>0x024</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>ISENSE0</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>ISENSE1</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>ISENSE2</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>ISENSE3</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>ISENSE4</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>ISENSE5</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>ISENSE6</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IBE</name>
				<description>Interrupt both edges register.</description>
				<addressOffset>0x028</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>IBE0</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>IBE1</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>IBE2</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>IBE3</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>IBE4</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>IBE5</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>IBE6</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IEV</name>
				<description>Interrupt event register.</description>
				<addressOffset>0x02C</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>IEV0</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>IEV1</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>IEV2</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>IEV3</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>IEV4</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>IEV5</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>IEV6</name>
						<description>Selects interrupt on pin PIOn_x to be triggered rising or falling edges. 0 = Depending on setting in register GPIOnIS, falling edges or LOW level on pin PIOn_x trigger an interrupt.  1 = Depending on setting in register GPIOnIS, rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IE</name>
				<description>Interrupt mask register.</description>
				<addressOffset>0x030</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASK0</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>MASK1</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>MASK2</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>MASK3</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>MASK4</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>MASK5</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>MASK6</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = Interrupt on pin PIOn_x is masked.  1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
