lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
			<register>
				<name>RIS</name>
				<description>Raw interrupt status register.</description>
				<addressOffset>0x034</addressOffset>
				<access>read-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RAWST0</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RAWST1</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RAWST2</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RAWST3</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RAWST4</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RAWST5</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RAWST6</name>
						<description>Raw interrupt status.  0 = No interrupt on pin PIOn_x.  1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>MIS</name>
				<description>Masked interrupt status register.</description>
				<addressOffset>0x038</addressOffset>
				<access>read-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASK0</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>MASK1</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>MASK2</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>MASK3</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>MASK4</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>MASK5</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>MASK6</name>
						<description>Selects interrupt on pin PIOn_x to be masked. 0 = No interrupt or interrupt masked on pin PIOn_x.  1 = Interrupt on PIOn_x.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IC</name>
				<description>Interrupt clear register.</description>
				<addressOffset>0x03C</addressOffset>
				<access>write-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CLR0</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CLR1</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CLR2</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CLR3</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CLR4</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CLR5</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CLR6</name>
						<description>Selects interrupt on pin PIOn_x to be cleared. Clears the interrupt edge detection logic. 0 = No effect.  1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
		</registers>
    </peripheral>
	<peripheral>
		<name>GPIO2</name>
		<description>Product name title=UM10441 Chapter title=LPC122x General Purpose I/O (GPIO) Modification date=2/11/2011 Major revision=0 Minor revision=17 </description>
		<groupName>GPIO</groupName>
		<baseAddress>0x50020000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFFF</size> 
		<usage>registers</usage> 
		</addressBlock>
		<interrupt>
			<name>PIO2</name>
			<value>27</value>
		</interrupt>
		<registers>
			<register>
				<name>MASK</name>
				<description>Pin value mask register. Affects operations on PIN, OUT, SET, CLR, and NOT registers.</description>
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASK0</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>MASK1</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>MASK2</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>MASK3</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>MASK4</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>MASK5</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>MASK6</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>MASK7</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>MASK8</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>MASK9</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>MASK10</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK11</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>MASK12</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>MASK13</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>MASK14</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>MASK15</name>
						<description>GPIO pin PIOn_x access control. 0 = read/write not masked. 1 = read/write masked.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>PIN</name>
				<description>Pin value register.</description>
				<addressOffset>0x004</addressOffset>
				<access>read-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>PIN0</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>PIN1</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>PIN2</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>PIN3</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>PIN4</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>PIN5</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>PIN6</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>PIN7</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>PIN8</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>PIN9</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>PIN10</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>PIN11</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>PIN12</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>PIN13</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>PIN14</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>PIN15</name>
						<description>GPIO pin PIOn_x value. 0 = Digital pin level is LOW. 1 = Digital pin level is HIGH.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>OUT</name>
				<description>Pin output value register.</description>
				<addressOffset>0x008</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>OUT0</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>OUT1</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>OUT2</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>OUT3</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>OUT4</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>OUT5</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>OUT6</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>OUT7</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>OUT8</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>OUT9</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>OUT10</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>OUT11</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>OUT12</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>OUT13</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>OUT14</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>OUT15</name>
						<description>GPIO pin PIOn_x output value. 0 = Write: Set GPIO output pin to LOW. Read: GPIO output value is LOW. 1 = Write: Set GPIO output pin to HIGH. Read: GPIO output value is HIGH.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>SET</name>
				<description>Pin output value set register.</description>
				<addressOffset>0x00C</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>SET0</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>SET1</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>SET2</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>SET3</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>SET4</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>SET5</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>SET6</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>SET7</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>SET8</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>SET9</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>SET10</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>SET11</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>SET12</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>SET13</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>SET14</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>SET15</name>
						<description>Set GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to HIGH.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
