lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
			<register>
				<name>CLR</name>
				<description>Pin output value clear register.</description>
				<addressOffset>0x010</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CLEAR0</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CLEAR1</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CLEAR2</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CLEAR3</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CLEAR4</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CLEAR5</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CLEAR6</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>CLEAR7</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>CLEAR8</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>CLEAR9</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>CLEAR10</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>CLEAR11</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>CLEAR12</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>CLEAR13</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>CLEAR14</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>CLEAR15</name>
						<description>Clear GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is set to LOW.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>NOT</name>
				<description>Pin output value invert register.</description>
				<addressOffset>0x014</addressOffset>
				<access>write-only</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>NOT0</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>NOT1</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>NOT2</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>NOT3</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>NOT4</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>NOT5</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>NOT6</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>NOT7</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>NOT8</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>NOT9</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>NOT10</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>NOT11</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>NOT12</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>NOT13</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>NOT14</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>NOT15</name>
						<description>Invert GPIO pin PIOn_x output value. 0 = No effect on the GPIO output level.  1 = GPIO output is inverted from its current value.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>DIR</name>
				<description>Data direction register.</description>
				<addressOffset>0x020</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>IO0</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>IO1</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>IO2</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>IO3</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>IO4</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>IO5</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>IO6</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>IO7</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>IO8</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>IO9</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>IO10</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>IO11</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>IO12</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>IO13</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>IO14</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>IO15</name>
						<description>Selects GPIO pin PIOn_x as input or output. 0 = Pin PIOn_x is configured as input.  1 = Pin PIOn_x is configured as output.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IS</name>
				<description>Interrupt sense register.</description>
				<addressOffset>0x024</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>ISENSE0</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>ISENSE1</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>ISENSE2</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>ISENSE3</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>ISENSE4</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>ISENSE5</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>ISENSE6</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>ISENSE7</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>ISENSE8</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>ISENSE9</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>ISENSE10</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>ISENSE11</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>ISENSE12</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>ISENSE13</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>ISENSE14</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>ISENSE15</name>
						<description>Selects interrupt on pin PIOn_x as level or edge sensitive. 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IBE</name>
				<description>Interrupt both edges register.</description>
				<addressOffset>0x028</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>IBE0</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>IBE1</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>IBE2</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>IBE3</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>IBE4</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>IBE5</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>IBE6</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>IBE7</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>IBE8</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>IBE9</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>IBE10</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>IBE11</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>IBE12</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[12:12]</bitRange>
					</field>
					<field>
						<name>IBE13</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[13:13]</bitRange>
					</field>
					<field>
						<name>IBE14</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[14:14]</bitRange>
					</field>
					<field>
						<name>IBE15</name>
						<description>Selects interrupt on pin PIOn_x to be triggered on both edges. 0 = Interrupt on pin PIOn_x is controlled through register GPIOnIEV.  1 = Both edges on pin PIOn_x trigger an interrupt.</description>
						<bitRange>[15:15]</bitRange>
					</field>
				</fields>
			</register>
