lkolbly/cmsis-svd/data/NXP/LPC12D27.svd
		</registers>
    </peripheral>
	<peripheral>
		<name>FLASHCTRL</name>
		<description>Product name title=UM10441 Chapter title=LPC122x System control (SYSCON) Modification date=2/16/2011 Major revision=1 Minor revision=0 </description>
		<groupName>FLASHCTRL</groupName>
		<baseAddress>0x50060000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFF</size> 
		<usage>registers</usage> 
		</addressBlock>					
		<registers>
			<register>
				<name>FLASHCFG</name>
				<description>Flash read cycle configuration</description>
				<addressOffset>0x028</addressOffset>
				<access>read-write</access>
				
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RDCFG</name>
						<description>Flash memory read access time</description>
						<bitRange>[1:0]</bitRange>
						<enumeratedValues>
						<name>test</name>
							<enumeratedValue>
								<name>2CYCLES</name>
								<description>2 system clock cycles flash access time</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>3CYCLES</name>
								<description>3 system clock cycles flash access time</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>4CYCLES</name>
								<description>4 system clock cycles flash access time</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>5CYCLES</name>
								<description>5 system clock cycles flash access time</description>
								<value>0x3</value>
							</enumeratedValue>							
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:2]</bitRange>
						
					</field>
				</fields>
			</register>
		</registers>
	</peripheral>			
			
			
	<peripheral>
		<name>CRC</name>
		<description>Product name title=UM10441 Chapter title=LPC122x CRC engine Modification date=2/11/2011 Major revision=0 Minor revision=17 </description>
		<groupName>CRC</groupName>
		<baseAddress>0x50070000</baseAddress>
		<addressBlock>
        <offset>0</offset> 
		<size>0xFFFF</size> 
		<usage>registers</usage> 
		</addressBlock>		
		<registers>
			<register>
				<name>MODE</name>
				<description>CRC mode register</description>
				<addressOffset>0x00</addressOffset>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CRC_POLY</name>
						<description>CRC polynom 1X= CRC-32 polynomial 01= CRC-16 polynomial 00= CRC-CCITT polynomial</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>BIT_RVS_WR</name>
						<description>Data bit order: 1= Bit order reverse for CRC_WR_DATA (per byte) 0= No bit order reverse for CRC_WR_DATA (per byte)</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CMPL_WR</name>
						<description>Data complement: 1= 1's complement for CRC_WR_DATA 0= No 1's complement for CRC_WR_DATA</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>BIT_RVS_SUM</name>
						<description>CRC sum bit order: 1= Bit order reverse for CRC_SUM 0= No bit order reverse for CRC_SUM</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CMPL_SUM</name>
						<description>CRC sum complement: 1= 1's complement for CRC_SUM 0=No 1's complement for CRC_SUM</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>Reserved</name>
						<description>Always 0 when read</description>
						<bitRange>[31:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>SEED</name>
				<description>CRC seed register</description>
				<addressOffset>0x04</addressOffset>
				<access>read-write</access>
				<resetValue>0x0000FFFF</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CRC_SEED</name>
						<description>A write access to this register will load CRC seed value to CRC_SUM register with selected bit order and 1's complement pre-processes. A write access to this register will overrule the CRC calculation in progresses.</description>
						<bitRange>[31:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>SUM</name>
				<description>CRC checksum register</description>
				<addressOffset>0x08</addressOffset>
				<access>read-only</access>
				<resetValue>0x0000FFFF</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CRC_SUM</name>
						<description>The most recent CRC sum can be read through this register with selected bit order and 1's complement post-processes.</description>
						<bitRange>[31:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>WR_DATA</name>
				<description>CRC data register</description>
				<alternateRegister>SUM</alternateRegister>
				
				<addressOffset>0x08</addressOffset>
				<access>write-only</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CRC_WR_DATA</name>
						<description>Data written to this register will be taken to perform CRC calculation with selected bit order and 1's complement pre-process. Any write size 8, 16 or 32-bit are allowed and accept back-to-back transactions.</description>
						<bitRange>[31:0]</bitRange>
					</field>
				</fields>
			</register>
		</registers>
	</peripheral>






	
  </peripherals>
 </device>																				
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
																							
